Sub-IoT/Sub-IoT-Stack/stack/framework/hal/chips/efm32gg/usb/inc/em_usb.h
/*** -------------------- Serial port debug configuration ---------------- ***/

#if defined( DOXY_DOC_ONLY )
/** @addtogroup USB_COMMON
 *  @{*/

/***************************************************************************//**
 * @brief
 *   Transmit a single char on the debug serial port.
 *
 * @note
 *   This function is enabled with \#define DEBUG_USB_API when configuring the
 *   protocol stack in "usbconfig.h".
 *   This is convenient when debugging code, no need to remove use of this
 *   function when debugging has completed.
 *
 * @param[in] c
 *   Char to transmit.
 *
 * @return
 *   The char transmitted.
 ******************************************************************************/
int  USB_PUTCHAR( char c );

/***************************************************************************//**
 * @brief
 *   Transmit a zero terminated string on the debug serial port.
 *
 * @note
 *   This function is enabled with \#define DEBUG_USB_API when configuring the
 *   protocol stack in "usbconfig.h".
 *   This is convenient when debugging code, no need to remove use of this
 *   function when debugging has completed.
 *
 * @param[in] p
 *   Pointer to string to transmit.
 ******************************************************************************/
void USB_PUTS( const char *p );

/***************************************************************************//**
 * @brief
 *   Transmit "printf" formated data on the debug serial port.
 *
 * @note
 *   This function is enabled with \#define USB_USE_PRINTF when configuring the
 *   protocol stack in "usbconfig.h".
 *   This is convenient when debugging code, no need to remove use of this
 *   function when debugging has completed.
 *
 * @param[in] format
 *   Format string (as in printf). No floating point format support.
 ******************************************************************************/
int  USB_PRINTF( const char *format, ... );

/** @} (end addtogroup USB_COMMON) */
#endif /* defined( DOXY_DOC_ONLY ) */

/** @cond DO_NOT_INCLUDE_WITH_DOXYGEN */

/* Hardware constraint, do not change. */
#define MAX_NUM_HOSTCHANNELS  14

/* The DMA engine use one FIFO ram word for each host channel. */
#define MAX_HOST_FIFO_SIZE_INWORDS (512-MAX_NUM_HOSTCHANNELS)/*Unit is 4 bytes*/

#if defined ( USER_PUTCHAR )
  void USB_Puts( const char *p );
  #define USB_PUTS( s )            USB_Puts( s )
  #define USB_PUTCHAR( c )         USER_PUTCHAR( c )
#else
  #define USB_PUTS( s )
  #define USB_PUTCHAR( c )
#endif

#if defined( USB_USE_PRINTF )
  /* Use a printf which don't support floating point formatting */
  #if defined(__ICCARM__) || defined (__CC_ARM) || defined (__CROSSWORKS_ARM)
    #define USB_PRINTF                  printf
  #else
    #define USB_PRINTF                  iprintf
  #endif
#else
  #define USB_PRINTF(...)
#endif /* defined( USB_USE_PRINTF ) */

#if defined( DEBUG_USB_API )
  #define DEBUG_USB_API_PUTS( s )       USB_PUTS( s )
  #define DEBUG_USB_API_PUTCHAR( c )    USB_PUTCHAR( c )
#else
  #define DEBUG_USB_API_PUTS( s )
  #define DEBUG_USB_API_PUTCHAR( c )
#endif /* defined( DEBUG_USB_API ) */

/** @endcond */

/*** -------------------- Common API definitions ------------------------- ***/

/** @cond DO_NOT_INCLUDE_WITH_DOXYGEN */

#if defined( USB_HOST )
  #if defined( NUM_APP_TIMERS )
    #define NUM_QTIMERS ( NUM_HC_USED + 2 + NUM_APP_TIMERS + 1 )
  #else
    #define NUM_QTIMERS ( NUM_HC_USED + 2 + 1 )
  #endif
  /* + 2 for default ctrl. host ch. 0 & 1, + 1 for host port timer  */
#else
  #if defined( NUM_APP_TIMERS )
    #define NUM_QTIMERS ( NUM_APP_TIMERS )
  #else
    #define NUM_QTIMERS 0
  #endif
#endif /* defined( USB_HOST ) */
/** @endcond */

/** @addtogroup USB_COMMON
 *  @{*/

/***************************************************************************//**
 * @brief
 *  USB transfer callback function.
 *
 * @details
 *  The callback function is called when a transfer has completed. An application
 *  should check the status, xferred and optionally the remaining parameters
 *  before deciding if the transfer is usable. In the case where the transfer
 *  is part of a control request data stage, the callback function should
 *  return an appropriate @ref USB_Status_TypeDef status.
 *
 * @param[in] status
 *   The transfer status. See @ref USB_Status_TypeDef.
 *
 * @param[in] xferred
 *   Number of bytes actually transferred.
 *
 * @param[in] remaining
 *   Number of bytes not transferred.
 *
 * @return
 *   @ref USB_STATUS_OK on success, else an appropriate error code.
 ******************************************************************************/
typedef int  (*USB_XferCompleteCb_TypeDef)( USB_Status_TypeDef status, uint32_t xferred, uint32_t remaining );

/***************************************************************************//**
 * @brief
 *  USBTIMER callback function.
 *
 * @details
 *  The callback function is called when an USBTIMER has expired. The callback
 *  is done with interrupts disabled.
 ******************************************************************************/
typedef void (*USBTIMER_Callback_TypeDef)(  void );

char *USB_GetErrorMsgString(            int error );

#if defined( USB_USE_PRINTF )
  void USB_PrintErrorMsgString(         char *pre, int error );
#else
  #define USB_PrintErrorMsgString(      pre, error )
#endif

void  USBTIMER_DelayMs(                 uint32_t msec );
void  USBTIMER_DelayUs(                 uint32_t usec );
void  USBTIMER_Init(                    void );

#if ( NUM_QTIMERS > 0 )
  void  USBTIMER_Start(                 uint32_t id, uint32_t timeout, USBTIMER_Callback_TypeDef callback );
  void  USBTIMER_Stop(                  uint32_t id );
#endif /* ( NUM_QTIMERS > 0 ) */
/** @} (end addtogroup USB_COMMON) */

#if defined( USB_DEVICE )
/** @addtogroup USB_DEVICE
 *  @{*/
/*** -------------------- DEVICE mode API definitions -------------------- ***/

/***************************************************************************//**
 * @brief
 *  USB Reset callback function.
 * @details
 *  Called whenever USB reset signalling is detected on the USB port.
 ******************************************************************************/
typedef void (*USBD_UsbResetCb_TypeDef)( void );

/***************************************************************************//**
 * @brief
 *  USB Start Of Frame (SOF) interrupt callback function.
 *
 * @details
 *  Called at each SOF interrupt (if enabled),
 *
 * @param[in] sofNr
 *   Current frame number. The value rolls over to 0 after 16383 (0x3FFF).
 ******************************************************************************/
typedef void (*USBD_SofIntCb_TypeDef)( uint16_t sofNr );

/***************************************************************************//**
 * @brief
 *  USB State change callback function.
 *
 * @details
 *  Called whenever the device change state.
 *
 * @param[in] oldState
 *   The device USB state just leaved. See @ref USBD_State_TypeDef.
 *
 * @param[in] newState
 *   New (the current) USB device state. See @ref USBD_State_TypeDef.
 ******************************************************************************/
typedef void (*USBD_DeviceStateChangeCb_TypeDef)( USBD_State_TypeDef oldState, USBD_State_TypeDef newState );

/***************************************************************************//**
 * @brief
 *  USB power mode callback function.
 *
 * @details
 *  Called whenever the device stack needs to query if the device is currently
 *  self- or bus-powered. Typically when host has issued an @ref GET_STATUS
 *  setup command.
 *
 * @return
 *  True if self-powered, false otherwise.
 ******************************************************************************/
typedef bool (*USBD_IsSelfPoweredCb_TypeDef)( void );

/***************************************************************************//**
 * @brief
 *  USB setup request callback function.
 *
 * @details
 *  Called on each setup request received from host. This gives the application a
 *  possibility to extend or override standard requests, and to implement class
 *  or vendor specific requests. Return @ref USB_STATUS_OK if the request is
 *  handled, return @ref USB_STATUS_REQ_ERR if it is an illegal request or
 *  return @ref USB_STATUS_REQ_UNHANDLED to pass the request on to the default
 *  request handler.
 *
 * @param[in] setup
 *  Pointer to an USB setup packet. See @ref USB_Setup_TypeDef.
 *
 * @return
 *  An appropriate status/error code. See @ref USB_Status_TypeDef.
 ******************************************************************************/
typedef int  (*USBD_SetupCmdCb_TypeDef)( const USB_Setup_TypeDef *setup );

